{
  "basics": {
    "name": "Anudeep GI",
    "label": "Full Stack Developer",
    "email": "anu1488@gmail.com",
    "phone": "+91 8921720345",
    "summary": "Experienced Full Stack Developer with 11 years in the industry and high-level proficiency in JavaScript, Node.js, React.js, CSS, HTML, and PHP. Currently seeking a position where I can utilize my skills to create scalable applications and contribute to innovative projects.",
    "location": {
      "city": "Bangalore",
      "countryCode": "IN",
      "region": "Karnataka"
    },
    "profiles": []
  },
  "work": [
    {
      "company": "Accenture",
      "position": "Software Engineer",
      "startDate": "2019-10-01",
      "endDate": "Present",
      "summary": "Involved in multiple projects for clients Cigna and Microsoft, where I focused on developing admin panels, integrating RESTful APIs, refactoring code, building reusable components, and handling end-to-end test cases. The key technologies I used include React.js, Material UI, CSS, HTML, Mobx, TypeScript.",
      "highlights": [
        {
          "project": "Client - Cigna",
          "tasks": [
            "Developed an admin panel with CRUD operations for displaying various jobs.",
            "Collaborated with UI designers to convert Adobe XD designs into functional webpages.",
            "Integrated RESTful APIs with the user interface.",
            "Conducted code refactoring to improve code quality and maintainability.",
            "Built reusable components for cross-company usage."
          ],
          "technologies": ["React.js", "Material UI", "CSS", "HTML"]
        },
        {
          "project": "Client - Microsoft",
          "tasks": [
            "Collaborated on building new features for the Microsoft Teams admin center.",
            "Addressed UI bugs in the production environment.",
            "Developed end-to-end test cases using protractor.js and resolved failures in the CI/CD pipeline.",
            "Migrated legacy API calls to newer ones and conducted thorough testing.",
            "Monitored API failures using tools like Kusto logs."
          ],
          "technologies": ["React.js", "Mobx", "TypeScript", "CSS", "HTML"]
        }
      ]    
    },
    {
      "name": "DIYA SYSTEM",
      "position": "Senior Software Developer",
      "startDate": "2016-06-01",
      "endDate": "2019-09-01",
      "summary": "Involved in diverse projects such as chatbot functionality using Landbot and Dialogflow, backend development with Node.js (Express.js) and MySQL, and frontend development using Angular 6. Developed ReactJS components and integrated the Evergage platform for EEP 3.0 project.",
      "highlights": [
        {
          "project": "beta1.bkpack.coms",
          "tasks": [
            "Implemented chatbot functionality using Landbot and Dialogflow.",
            "Created a demo for clients using Dialogflow's V1 API.",
            "Developed the backend using Node.js (Express.js) and MySQL.",
            "Designed and implemented RESTful APIs using Express.js and MySQL.",
            "Developed endpoints with scoring algorithms.",
            "Collaborated on the frontend development using Angular 6."
          ],
          "technologies": ["Landbot", "Dialogflow", "Node.js", "Express.js", "MySQL", "Angular 6"]
        },
        {
          "project": "Website Build",
          "tasks": [
            "Converted PSD designs to webpage using HTML, CSS and Sass, JavaScript/jQuery, and Perl (Mason Framework) for IPage.com, Bluehost.com, Hostgator.com, and Netfirms.com, Hostgator.com."
          ],
          "technologies": ["HTML", "CSS", "Sass", "JavaScript", "jQuery", "Perl"]
        },
        {
          "project": "EEP 3.0",
          "tasks": [
            "Developed ReactJS component and integrated the Evergage platform."
          ],
          "technologies": ["ReactJS", "Evergage"]
        },
        {
          "project": "General Responsibilities",
          "tasks": [
            "Actively contributed to project planning and task estimation in Sprint Grooming and Planning sessions.",
            "Developed user interfaces to meet client requirements and align with visual and functional specifications.",
            "Created exceptional user experiences through usability and user-centered design principles.",
            "Transformed design files into responsive and interactive web pages.",
            "Implemented Monetate experiences using JavaScript for targeted and personalized content delivery.",
            "Created Google Tag Manager (GTM) tags and triggers for user behavior tracking and insights.",
            "Conducted timely bug fixes to ensure optimal functionality and user experience."
          ]
        }
      ]
    },
    {
      "company": "UTILE SOFTWARE SOLUTIONS PVT. LTD.",
      "position": "Software Engineer",
      "startDate": "2015-12-01",
      "endDate": "2016-05-01",
      "summary": "Developed custom WordPress themes, integrated AngularJS 1 API frontends, designed intuitive user interfaces using CSS and HTML, and implemented responsive design principles. Conducted testing and debugging to ensure WordPress themes consistency and functionality. Collaborated with cross-functional teams and implemented best practices for code organization and performance optimization in WordPress themes.",
      "highlights": [
        {
          "project": "General Responsibilities",
          "tasks": [
            "Developed custom WordPress themes for visually appealing and functional websites.",
            "Integrated AngularJS 1 API frontends for seamless frontend-backend communication.",
            "Designed intuitive user interfaces (UI) using CSS and HTML for polished and engaging experiences.",
            "Implemented responsive design principles for optimal performance across devices and screen sizes.",
            "Conducted thorough testing and debugging to ensure WordPress themes consistency and functionality.",
            "Collaborated with cross-functional teams, including designers and backend developers, for seamless integration.",
            "Implemented best practices for code organization, maintainability, and performance optimization in WordPress themes."
          ],
          "technologies": ["WordPress", "AngularJS 1", "CSS", "HTML"]
        }
      ]
    },
    {
      "company": "GIGAQUIRKS",
      "position": "Software Engineer",
      "startDate": "2014-04-01",
      "endDate": "2015-07-01",
      "summary": "Projects Undertaken: Select.gigaquirks.com, WordPress, Magneto, jQuery Animation Site",
      "highlights": [
        {
          "project": "Select.gigaquirks.com",
          "tasks": [
            "Designed and implemented database structure for enhanced data management.",
            "Developed the project using CodeIgniter (PHP, MVC) framework for scalability and maintainability.",
            "Utilized JavaScript, jQuery, and Ajax for interactive user interfaces.",
            "Integrated fullcalendar.js for efficient calendar functionality.",
            "Implemented responsive design using Bootstrap, CSS, and HTML."
          ],
          "technologies": ["CodeIgniter", "PHP", "MVC", "JavaScript", "jQuery", "Ajax", "fullcalendar.js", "Bootstrap", "CSS", "HTML"]
        },
        {
          "project": "WordPress",
          "tasks": [
            "Collaborated with clients to understand requirements and developed custom solutions.",
            "Utilized jQuery, JavaScript, and other libraries based on client needs.",
            "Developed interactive and engaging websites using WordPress's extensive functionality."
          ],
          "technologies": ["WordPress", "jQuery", "JavaScript"]
        },
        {
          "project": "Magneto",
          "tasks": [
            "Conducted bug fixes to improve performance and resolve issues on the Magneto platform."
          ],
          "technologies": ["Magneto"]
        },
        {
          "project": "jQuery Animation Site",
          "tasks": [
            "Developed a visually appealing website with animated elements using jQuery, creating an engaging user experience."
          ],
          "technologies": ["jQuery"]
        },
        {
          "project": "General Responsibilities",
          "tasks": [
            "Implemented wireframing and prototyping for efficient UI design and development.",
            "Contributed to the development of relational databases for optimized data management.",
            "Provided technical support for large-scale website development projects.",
            "Collaborated with team members to create visually appealing and functional UIs.",
            "Integrated program code with content management systems for effective content delivery.",
            "Kept up-to-date with web development methods and UI design trends.",
            "Managed technical tasks and facilitated efficient project workflow.",
            "Acted as a liaison between vendors, developers, and project managers.",
            "Mentored developers and contributed to significant software components and interfaces.",
            "Ensured developers understood project scope and potential impacts.",
            "Monitored developers' progress and addressed potential delays or issues.",
            "Communicated technical matters to project managers and sponsors in business terms."
          ]
        }
      ]
    },
    {
      "company": "CODE CRAFT TECHNOLOGY",
      "position": "Software Engineer",
      "startDate": "2013-01-01",
      "endDate": "2014-01-01",
      "summary": "Managed full lifecycle of development and support projects. Created front-end designs for multiple client sites and provided guidance to clients on technology, processes, and application-related aspects. Coordinated end-to-end software product development. Developed an admin panel, web service, integrated weather API and implemented push notifications.",
      "highlights": [
        {
          "project": "Code Craft Homepage Redesign",
          "tasks": [
            "Redesigned Code Craft homepage (Codecraft.co.in) to enhance visual appeal and user experience."
          ],
          "technologies": []
        },
        {
          "project": "Maville",
          "tasks": [
            "Developed an admin panel and web service using Bootstrap 3 and CodeIgniter (MVC, PHP).",
            "Utilized JQuery, JavaScript, AJAX, and implemented database design.",
            "Integrated weather API for enhanced functionality."
          ],
          "technologies": ["Bootstrap 3", "CodeIgniter", "PHP", "MVC", "JQuery", "JavaScript", "AJAX"]
        },
        {
          "project": "Fanspectrum.com",
          "tasks": [
            "Conducted bug fixing for JavaScript, JQuery, and PHP components.",
            "Resolved UI and CSS-related issues."
          ],
          "technologies": ["JavaScript", "JQuery", "PHP", "CSS"]
        },
        {
          "project": "Renault.co.nz",
          "tasks": [
            "Converted PSD designs to a SilverStripe theme using PHP."
          ],
          "technologies": ["PSD", "SilverStripe", "PHP"]
        },
        {
          "project": "Birthday Buddy",
          "tasks": [
            "Developed an admin panel and implemented push notifications."
          ],
          "technologies": ["Admin panel", "Push notifications"]
        },
        {
          "project": "Demo projects for clients",
          "tasks": [
            "Created custom solutions using WordPress and PhoneGap based on client requirements."
          ],
          "technologies": ["WordPress", "PhoneGap"]
        },
        {
          "project": "General Responsibilities",
          "tasks": [
            "Managed full lifecycle of development and support projects, including requirements analysis, development, delivery, support, analysis, and documentation.",
            "Created front-end designs for multiple client sites, focusing on user interfaces.",
            "Provided guidance to clients on technology, processes, and application-related aspects for better understanding and satisfaction.",
            "Coordinated end-to-end software product development, from requirement analysis to coding, testing, and debugging.",
            "Ensured timely implementation of projects and offered post-implementation support and technical assistance to end-users."
          ]
        }
      ]
    },
    {
      "company": "BILL MAIL ID PVT. LTD.",
      "position": "Jr. Software Developer",
      "startDate": "2011-08-01",
      "endDate": "2013-01-01",
      "summary": "Projects Undertaken: BillmailId.com, Bmdhouse.com, Paymycabletv.in",
      "highlights": [
        {
          "projectName": "BillmailId.com",
          "tasks": [
            "Developed the website using Ruby on Rails framework.",
            "Implemented social login functionality to enhance user experience.",
            "Implemented secure methods for password change feature.",
            "Utilized JQuery for form validation and tooltips."
          ]
        },
        {
          "projectName": "Bmdhouse.com",
          "tasks": [
            "Converted PSD designs to HTML, ensuring pixel-perfect implementation.",
            "Created engaging animations using JQuery.",
            "Implemented CSS and HTML to ensure proper styling and structure.",
            "Utilized PHP for server-side functionality."
          ]
        },
        {
          "projectName": "Paymycabletv.in",
          "tasks": [
            "Developed the website using CodeIgniter (PHP) framework.",
            "Utilized JQuery, JavaScript, and AJAX for dynamic and interactive features.",
            "Implemented CSS and HTML for styling and structure."
          ]
        }
      ]    }
  ],
  "education": [
    {
      "institution": "Mangalore University",
      "area": "Computer Application",
      "studyType": "Bachelor",
      "startDate": "2006-01-01",
      "endDate": "2009-01-01",
      "courses": []
    },
    {
      "institution": "Genius Port, Mangalore University",
      "area": "Animation & VFX",
      "studyType": "Diploma",
      "startDate": "2009-01-01",
      "endDate": "2010-01-01",
      "courses": []
    },
    {
      "institution": "Genius Port",
      "area": "Android Application Development",
      "studyType": "Course",
      "startDate": "2010-01-01",
      "endDate": "2011-01-01",
      "courses": []
    }
  ],
  "skills": [
    {
      "name": "Client-Side Technology",
      "keywords": ["HTML (8+ years, Expert)", "CSS (8+ years, Expert)", "JavaScript (9+ years, Expert)", "jQuery (7+ years, Expert)", "Bootstrap (4+ years, Beginner)", "Angularjs 1 (0.6 years, Beginner)", "ReactJS (6 years, Intermediate)", "Angular 6 (1 year, Beginner)"]
    },
    {
      "name": "Server Side",
      "keywords": ["Nodejs (ExpressJS)( Web Services) (6+ years, Expert)", "PHP (Codeigniter) (5+ years, Expert)", "Perl (Mason) (1+ year, Beginner)", "MySQL (4+ years, Intermediate)", "Slim frame (PHP) (1+ year, Intermediate)"]
    },
    {
      "name": "CMS",
      "keywords": ["WordPress (3+ years, Intermediate)", "Silverstripe (1 year, Beginner)"]
    },
    {
      "name": "Server/Hosting",
      "keywords": ["AWS", "VPS (ssdnode)", "Shared Hosting (Godaddy, Bluehost, HostGator, iPage)"]
    },
    {
      "name": "Version Control",
      "keywords": ["Git", "SVN"]
    },
    {
      "name": "Software",
      "keywords": ["Adobe Photoshop", "Adobe Illustrator", "Visual Basics", "Android SDK", "Dream Viewer", "Adobe Flash", "3D MAX", "Autodesk Maya", "Adobe After Effect", "Sound Forge"]
    },
    {
      "name": "Operating Systems",
      "keywords": ["Windows XP/Vista/7", "Linux", "Ubuntu"]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "Hindi",
      "fluency": "Fluent"
    },
    {
      "language": "Kannada",
      "fluency": "Fluent"
    },
    {
      "language": "Malayalam",
      "fluency": "Fluent"
    },
    {
      "language": "Tulu",
      "fluency": "Fluent"
    }
  ],
  "interests": [],
  "references": [],
  "projects": [],
  "volunteer": [],
  "awards": [],
  "publications": [],
  "certificates": []
}
